ROR/Day 52/Student/app/controllers/student_reports_controller.rb

SELECT "student_reports".* FROM "student_reports"
---
  def index
    @student_reports = StudentReport.friendly.all

INSERT INTO "student_reports" ("name", "roll_no", "email", "maths", "physics", "chemistry", "created_at", "updated_at", "gender", "slug") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @student_report = StudentReport.new(student_report_params)

    respond_to do |format|
      if @student_report.save
        StudentMailer.create_notification(@student_report)

UPDATE "student_reports" SET "name" = ?, "updated_at" = ?, "slug" = ? WHERE "student_reports"."id" = ?  [["name", "Ravindra Kaliya12"], ["updated_at", "2022-12-07 10:39:49.924391"], ["slug", "ravindra-kaliya12"], ["id", 1]]
UPDATE "student_reports" SET "updated_at" = ?, "gender" = ? WHERE "student_reports"."id" = ?  [["updated_at", "2022-12-07 09:19:54.768247"], ["gender", "Male"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @student_report.update(student_report_params)
        StudentMailer.update_notification(@student_report)

DELETE FROM "student_reports" WHERE "student_reports"."id" = ?  [["id", 3]]
---
  def destroy
    StudentMailer.delete_notification(@student_report)
    @student_report.destroy

SELECT "student_reports".* FROM "student_reports" WHERE "student_reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_student_report
      @student_report = StudentReport.find(params[:id])