ROR/Day 52/Student/app/mailers/student_mailer.rb

SELECT "student_reports"."email" FROM "student_reports"
---
  def create_notification(object)
    @object = object
    @object_count = object.class.count

    # emails = [@object.email, 'from@example.com']

    emails = StudentReport.pluck(:email)

SELECT "student_reports"."email" FROM "student_reports"
---
  def update_notification(object)
    @object = object
    @object_count = object.class.count

    # emails = [@object.email, 'from@example.com']

    emails = StudentReport.pluck(:email)

SELECT "student_reports"."email" FROM "student_reports"
---
  def delete_notification(object)
    @object = object
    @object_count = object.class.count

    # emails = [@object.email, 'from@example.com']

    emails = StudentReport.pluck(:email)